## Student Data Analysis

In this activity, you will use the steps below to analyze a dataset of student test scores from schools in a fake school district.

1. Collect the data.

2. Prepare the data.

3. Summarize the data. 

4. Drill down into the data. 

5. Make comparisons.

### Import required libraries and dependencies

<!-- https://pypi.org/project/pathlib2/ -->

In [1]:
import pandas as pd
import os

## Step 1: Collect the data.

To collect the data that youâ€™ll need, complete the following steps:

**1. Using the Pandas `read_csv` function and the `os.path.join` function, import the data from the `new_student_data.csv` file, and create a DataFrame called student_df.**

In [2]:
student_data = os.path.join('../Resources/new_student_data.csv')
student_df = pd.read_csv(student_data)

**2. Use the head (and/or the tail) function to confirm that Pandas properly imported the data.**

In [3]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

## Step 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
**1. Check for and replace all `NaN`, or missing, values in the student_df DataFrame.**

Use the following methods and functions to complete this section:
* `count()`
* `dropna()`
* `duplicated()`
* `sum()`
* `drop_duplicates()`

In [4]:
student_df.count()

student_id       13940
student_name     13940
grade            13940
school_name      13940
reading_score    12526
math_score       13235
school_type      13940
dtype: int64

In [5]:
# Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [6]:
# Drop null values using df.dropna() to delete the rows with misssing data
# Or replace NaN values with "",0,or mean with df.fillna("") or (0) or (df.mean())
# Use the comment below to check for really weird data
#student_df.count() + student_df.isna().sum()

student_df = student_df.dropna()

In [7]:
#student_df.count()
#student_df.isna().sum()

student_df.count()

student_id       11903
student_name     11903
grade            11903
school_name      11903
reading_score    11903
math_score       11903
school_type      11903
dtype: int64

In [8]:
# Check for duplicate rows
student_df.duplicated().sum()

1299

In [9]:
# Drop duplicate rows don't forget to set equal to a df or else it doesn't keep the changes
student_df = student_df.drop_duplicates()

In [10]:
student_df.duplicated().sum()

0

**2. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.**

In [11]:
# Check the type of the grade column with dtypes
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

In [12]:
# View the grade column to look for a reason it isn't numeric
student_df.grade.head()

0    11th
2    12th
3    11th
4    12th
5     9th
Name: grade, dtype: object

In [13]:
# Remove 'th' suffixes by replacing with and empty string
#test = student_df['grade'].str.replace('th',"",regex=False)
# the following returns series
#type(test)
student_df.loc[:,'grade'] = student_df.loc[:,'grade'].str.replace('th',"",regex=False)

In [14]:
# View the grade column to ensure the suffixes were removed
student_df.grade.head()

0    11
2    12
3    11
4    12
5     9
Name: grade, dtype: object

**3. Convert the data type of the "grade" column to a `int`.**

In [15]:
student_df.grade = student_df.grade.astype("int")

**4. Use the head (and/or the tail) function to preview the DataFrame.**

In [16]:
student_df.tail()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
13935,32277979,Kelly Myers,10,Sullivan High School,62.3,37.9,Public
13936,109412748,Kimberly Burke,10,Montgomery High School,99.5,89.8,Public
13937,16856426,Crystal Merritt,9,Turner High School,86.3,71.1,Public
13938,88213835,Misty Wiggins,10,Fisher High School,75.4,76.4,Public
13939,12153644,Michele Jones,11,Chang High School,69.0,72.4,Public

In [18]:
#student_df.dtypes
stats_df = student_df.describe()
#stats_df

#df.loc[len(df.index)] = ['Amy', 89, 93] 

#student_df.index

stats_df.loc[len(stats_df.index)] = [stats_df.loc['75%','student_id']-stats_df.loc['25%','student_id'],
                                     stats_df.loc['75%','grade']-stats_df.loc['25%','grade'],
                                     stats_df.loc['75%','reading_score']-stats_df.loc['25%','reading_score'],
                                     stats_df.loc['75%','math_score']-stats_df.loc['25%','math_score']]
stats_df

         student_id         grade  reading_score    math_score
count  1.060400e+04  10604.000000   10604.000000  10604.000000
mean   6.971953e+07     10.566013      75.241513     64.343248
std    3.470851e+07      1.128907      14.283955     16.662284
min    1.000132e+07      9.000000       9.500000      1.400000
25%    3.974626e+07     10.000000      65.900000     52.700000
50%    6.996368e+07     11.000000      76.400000     65.000000
75%    9.984440e+07     12.000000      86.300000     76.400000
max    1.299903e+08     12.000000     100.000000    100.000000
8      6.009814e+07      2.000000      20.400000     23.700000

## Good work!

You are now prepared to start the next lesson before starting step 3.